Revit 2026 API

# MetallicPaintMetallicpaintFinish Property

---

The property labeled "Finish" from the "MetallicPaint" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string MetallicpaintFinish { get; }
```
```vb
Public Shared ReadOnly Property MetallicpaintFinish As String
	Get
```
```cpp
public:
static property String^ MetallicpaintFinish {
	String^ get ();
}
```
```fsharp
static member MetallicpaintFinish : string with get
```

#### Property Value

String

This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "MetallicpaintFinishType".

#### Reference

MetallicPaint Class

Autodesk.Revit.DB.Visual Namespace